#Использовать "../src/model"

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	ВсеТесты = Новый Массив;
	
	ВсеТесты.Добавить("ТестДолжен_ОбработатьЗапросGetInfo");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
	УстановитьТекущийКаталог(ТекущийСценарий().Каталог);
	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ОбработатьЗапросGetInfo() Экспорт

	ПутьКФайлуЗапрос = ОбъединитьПути("..", "features", "fixtures", "requestBodyGetInfo.json");
	ПутьКФайлуОтвет = ОбъединитьПути("..", "features", "fixtures", "responseBodyGetInfo.json");
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуЗапрос, "utf-8");
	
	ТелоЗапросаТекст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	ТелоОтвета = ЗапросыИнфоОбОшибке.СформироватьОтвет(ТелоЗапросаТекст);

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуОтвет, "utf-8");
	ТелоОтветаЭталон = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Ожидаем.Что(ТелоОтвета).Равно(ТелоОтветаЭталон);
	
КонецПроцедуры
